app/views/beer_clubs/show.html.erb

<h2>Members</h2>
<% if @beer_club.memberships.empty? %>
---
SELECT "memberships".* FROM "memberships"  WHERE "memberships"."beer_club_id" = ?  [["beer_club_id", 1]]