app/views/users/show.html.erb

SELECT "memberships".* FROM "memberships"  WHERE "memberships"."user_id" = ?  [["user_id", 5]]
---
    <strong>Clubs:</strong>
    <% @user.memberships.each do |membership| %>

SELECT  1 AS one FROM "ratings"  WHERE "ratings"."user_id" = ? LIMIT 1  [["user_id", 5]]
SELECT "ratings".* FROM "ratings"  WHERE "ratings"."user_id" = ?  [["user_id", 5]]
---
    <strong><%= @user.username %></strong><br>
    <% if @user.ratings.empty? %>