app/controllers/beer_clubs_controller.rb

SELECT "memberships".* FROM "memberships"  WHERE "memberships"."beer_club_id" = ?  [["beer_club_id", 1]]
---
  def show
    @confirmed_members = Membership.where(beer_club_id: @beer_club.id, confirmed: true)