app/controllers/beers_controller.rb

INSERT INTO "beers" ("name", "style_id", "brewery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Urbock"], ["style_id", 1], ["brewery_id", 1], ["created_at", "2017-03-04 16:35:00.737894"], ["updated_at", "2017-03-04 16:35:00.737894"]]
---
  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save

DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 23]]
---
  def destroy
    if current_user.admin
      @beer.destroy