app/controllers/memberships_controller.rb

SELECT "beer_clubs".* FROM "beer_clubs"
---
  def new
    @membership = Membership.new
    @beer_clubs = BeerClub.all - current_user.beer_clubs

INSERT INTO "memberships" ("beer_club_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["beer_club_id", 1], ["created_at", "2017-02-01 01:29:48.160125"], ["updated_at", "2017-02-01 01:29:48.160125"], ["user_id", 5]]
SELECT "beer_clubs".* FROM "beer_clubs"
---
  def create
    @membership = Membership.new params.require(:membership).permit(:user_id, :beer_club_id)

    @membership.user_id = current_user.id

    if @membership.save
      current_user.memberships << @membership
      redirect_to user_path current_user
    else
      @beer_clubs = BeerClub.all