app/controllers/ratings_controller.rb

  def index
    @ratings = Rating.all
    @recent = @ratings.order('created_at DESC').limit(5)
    @users = User.all
---
SELECT "ratings".* FROM "ratings"
SELECT  "ratings".* FROM "ratings"  ORDER BY created_at DESC LIMIT 5
SELECT "users".* FROM "users"

  def create
    @rating = Rating.new params.require(:rating).permit(:score, :beer_id)

    if current_user.nil?
      redirect_to signin_path, notice:'you should be signed in'
    elsif @rating.save
      current_user.ratings << @rating  ## virheen aiheuttanut rivi
      redirect_to user_path current_user
    else
      @beers = Beer.all
---
INSERT INTO "ratings" ("score", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["score", 15], ["beer_id", 1], ["created_at", "2017-02-18 21:45:05.120290"], ["updated_at", "2017-02-18 21:45:05.120290"]]
SELECT "beers".* FROM "beers"