app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", "2017-01-31 21:25:28.789657"], ["updated_at", "2017-01-31 21:25:28.789657"], ["username", "eero"]]